/**********************************************************************************************************************
*                                        (c) COPYRIGHT by OAO SUPERTEL.                                             *
*                                               All rights reserved.                                                  *
***********************************************************************************************************************
* Module      : mpcdrvnbuf.c
*
* Description : Defenition Buffer's function for transmit <->recieve data on localbus P2020.
*
* Author      : Konstantin Shiluaev
*
******************************************************************************
******************************************************************************
*
* Module's Description Record:
* ============================
*
* $ProjectRevision: 0.0.1 $
* $Source: 
* $State: Debug$
* $Revision: 0.0.1 $ $Name: $
* $Date: 2012/10/23 10:40:51 $
* $Locker: $
*
* Module's revision history:
* ==========================
* --------- $Log: mpcdrvnbuf.c $
* --------- Initial revision
******************************************************************************/


/*-----------------------------------------------------------------------------
GENERAL NOTES
-----------------------------------------------------------------------------*/

/*****************************************************************************/
/*	COMMON CONFIGURATION						     */
/*****************************************************************************/

/*****************************************************************************/
/*	INCLUDES							     */
/*****************************************************************************/
#include "mpcdrvngraf.h"
/*External Header*/

/*****************************************************************************/
/*	PRIVATE MACROS							     */
/*****************************************************************************/
struct ngarf_setevoi_element
{
/////point begining
//IP address
//num landing
//port number
/////point end
//IP address
//num landing
//port number	
};
/*****************************************************************************/
/*	PRIVATE DATA TYPES						     */
/*****************************************************************************/
UINT16 number_peak=6;                          ///Количество вершин графа (сетевых элементов)
UINT16 cost_matrica_puti[6][6];                //матрица стоимостей путей
UINT16 max=0;                                  //вместо бесконечностей

/*****************************************************************************/
/*	PRIVATE FUNCTION PROTOTYPES					     */
/*****************************************************************************/
static void set_max_element_cost_matrica();
static bool in_arr(UINT16 j ,UINT16 *arr);



/* KERNEL MODULE HANDLING */


/*****************************************************************************/
/*	PRIVATE GLOBALS							     */
/*****************************************************************************/

  /*****************************************************************************/
/*	PUBLIC GLOBALS							     */
/*****************************************************************************/


/*****************************************************************************/
/*	EXTERNAL REFERENCES						     */
/*****************************************************************************/


/*****************************************************************************/
/*	PUBLIC FUNCTION DEFINITIONS					     */
/*****************************************************************************/


/*****************************************************************************/
/*	PRIVATE FUNCTION DEFINITIONS					     */
/*****************************************************************************/
/**************************************************************************************************
Syntax:      	    ngraf_get_datapacket (const u16 *in_buf ,const u16 in_size)
Parameters:     	void data
Remarks:			timer functions 

Return Value:	    1  =>  Success  ,-1 => Failure

***************************************************************************************************/
void ngraf_get_datapacket (const u16 *in_buf ,const u16 in_size)
{
u16 hex_element_size;	
u16 ngaf_ip_array[757];

	hex_element_size=in_size/2;
	memcpy(ngaf_ip_array,in_buf,hex_element_size);
    printk("+ngraf_get_datapacket\in_size_mas_byte= %d+\n\r",in_size);
    printk("+ngraf_get_datapacket\in_size_mas_element= %d+\n\r",in_size/2);
    printk("+ngraf_get_data_rfirst|0x%04x|0x%04x|0x%04x|0x%04x+\n\r",ngaf_ip_array[0],ngaf_ip_array[1],ngaf_ip_array[2],ngaf_ip_array[3]);
	printk("+ngraf_get_data_rlast |0x%04x|0x%04x|0x%04x|0x%04x+\n\r",ngaf_ip_array[hex_element_size-4],ngaf_ip_array[hex_element_size-3],ngaf_ip_array[hex_element_size-2],ngaf_ip_array[hex_element_size-1]);
	
}
















